Repository: 0xMRTT/raider
Catalog: help/*/*.po
Languages: es, it

# _
source: translator-credits
es: Óscar Fernández Díaz <oscfdezdz@tuta.io>, 2022
it: Albano Battistella <albano_battistella@hotmail.com>, 2022

# link:trail
source: File Shredder
es: Trituradora de archivos
it: Distruttore di File

# link
source: File Shredder Help
es: Ayuda de Trituradora de archivos
it: Aiuto per File Shredder

# text
source: File Shredder Help
es: Ayuda de Trituradora de archivos
it: File Shredders

source: Shred your files securely
es: Triture sus archivos de forma segura
it: Distruggi i tuoi file in modo sicuro

source: <_:media-1/> File Shredder
es: <_:media-1/> Trituradora de archivos

source: Getting Started
es: Cómo empezar
it: Come iniziare

source: Shredding a File
es: Triturar un archivo
it: Distruggere un file

source: Configuring the Options
es: Configurar las opciones
it: Configurare le opzioni

source: Troubleshooting
es: Solución de problemas
it: Risoluzione dei problemi

source: Introduction to <app>File Shredder</app>.
es: Introducción a <app>Trituradora de archivos</app>.
it: Introduzione a <app>File Shredder</app>.

source: Introduction
es: Introducción
it: Introduzione

source: <app>File Shredder</app> is a tool for shredding the files that you do not want to be recovered. It works on any file type possible, and supports many options as to how the shredding is done. Every file that is added to the list shreds at the same time, so it greatly reduces the time needed. It shows the current progress of every file loaded, so you know how far along each is.
es: <app>Trituradora de archivos</app> es una herramienta para triturar los archivos que no quiera que se recuperen. Funciona en cualquier tipo de archivo posible, y soporta muchas opciones en cuanto a cómo se hace la trituración. Cada archivo que se añade a la lista se tritura al mismo tiempo, por lo que se reduce en gran medida el tiempo necesario. Muestra el progreso actual de cada archivo cargado, para que sepa en qué punto se encuentra cada uno.
it: <app>File Shredder</app> è uno strumento per distruggere file che non vuoi recuperare. Funziona su qualsiasi tipo di archivio possibile e supporta molte opzioni su come viene eseguita la distruzione. Ogni file che viene aggiunto all'elenco viene distrutto nello stesso tempo, riducendo così notevolmente il tempo richiesto. Visualizza lo stato di avanzamento corrente di ogni file caricato, così saprai a che punto si trova ognuno.

source: Shredding is the obfuscation of a file, so that the previous contents are not recoverable. Optionally the file is deleted, but the obfuscation is needed because all files that are deleted can be recovered, and to keep the contents of the file secret, they have to be overwritten with random data before the file itself is deleted.
es: La trituración es la ofuscación de un archivo, de modo que su contenido anterior no sea recuperable. Opcionalmente, el archivo se elimina, pero la ofuscación es necesaria porque todos los archivos que se eliminan pueden ser recuperados, y para mantener el contenido del archivo en secreto, tienen que ser sobrescritos con datos aleatorios antes de que el propio archivo sea eliminado.
it: La distruzione è l'offuscamento di un file in modo che il suo contenuto precedente possa non essere recuperabile. Facoltativamente, il file viene eliminato, ma l'offuscamento è necessario perché tutti i file eliminati potrebbero essere recuperati, e per mantenere segreto il contenuto del file, devono essere sovrascritti con dati casuali prima che il file stesso sia RIMOSSO.

source: Creative Commons Attribution-ShareAlike 3.0 Unported License
es: Licencia Creative Commons Atribución-CompartirIgual 3.0 Unported
it: Licenza Creative Commons Attribuzione-Condividi allo stesso modo 3.0 Unported

source: This work is licensed under a <_:link-1/>.
es: Esta obra tiene una licencia <_:link-1/>.
it: Questo lavoro è concesso in licenza <_:link-1/>.

source: Add the files you want to shred.
es: Añada los archivos que desee triturar.
it: Aggiungi i file che vuoi distruggere.

source: Load a file
es: Cargar un archivo
it: Carica un file

source: You can open a file, or many, by pressing the button on the upper left next to the red Shred button, that contains a plus sign. Select the files you want to shred, and click OK.
es: Puedes abrir un archivo, o muchos, pulsando el botón de la parte superior izquierda, junto al botón rojo de Triturar, que contiene un signo más. Seleccione los archivos que desee triturar y haga clic en Aceptar.
it: Puoi aprire un file, o più, cliccando il pulsante in alto a sinistra, accanto al pulsante rosso Distruggi, che contiene un segno più. Seleziona i file che vuoi distruggere e fai clic su OK.

source: You can also drag and drop the files you want to shred all at once into an open <app>File Shredder</app> window.
es: También puede arrastrar y soltar los archivos que desee triturar de una sola vez en una ventana abierta de <app>Trituradora de archivos</app>.
it: Puoi anche trascinare e rilasciare i file che vuoi distruggere in una volta sola in una finestra aperta di <app>File Shredder</app>.

source: Shredding the files.
es: Triturarando los archivos.
it: Distruggere i file.

source: Shred the files
es: Triturar los archivos
it: Distruggi i file

source: When you have loaded all the files that you wish to shred, press the red <gui>Shred</gui> button at the upper left of the window, next to the add file button. Then each file loaded will acquire a progress bar that will show how much of the shredding has been finished.
es: Cuando haya cargado todos los archivos que desee triturar, pulse el botón rojo <gui>Triturar</gui> situado en la parte superior izquierda de la ventana, junto al botón de añadir archivo. A continuación, cada archivo cargado adquirirá una barra de progreso que mostrará el grado de finalización de la trituración.
it: Quando hai caricato tutti i file che vuoi distruggere, premi il pulsante rosso <gui>Distruggi</gui> situato in alto a sinistra della finestra, accanto al pulsante Aggiungi file. Quindi ogni file caricato acquisirà una barra di avanzamento che mostra il grado di avanzamento della distruzione.

source: When each file finishes shredding, it will disappear from the list, and a desktop notification will say that the shredding has been finished.
es: Cuando cada archivo termine de triturarse, desaparecerá de la lista, y una notificación en el escritorio dirá que la trituración ha terminado.
it: Al termine della distruzione di ogni file, scomparirà dall'elenco e una notifica sul desktop indicherà che la distruzione è terminata.

source: Do NOT close the window until all files have finished shredding. When the window goes back to its empty state, then all shredding is finished, and you can close the window safely.
es: NO cierre la ventana hasta que todos los archivos hayan terminado de ser triturados. Cuando la ventana vuelve a su estado vacío, entonces toda la trituración habrá terminado, y podrá cerrar la ventana con seguridad.
it: NON chiudere la finestra finché tutti i file non hanno finito di esseredistrutto. Quando la finestra torna vuota, l'intera la distruzione sarà finita e potrai chiudere la finestra in sicurezza.

source: The file does not shred.
es: El archivo no se tritura.
it: Il file non viene distrutto.

source: Problem shredding a file
es: Problema al triturar un archivo
it: Problema durante la distruzione di un file

source: If the files do not shred, make sure to reload the folder in which the file was in before shredding. Also make sure that the file is not a shortcut to the file you want to shred.
es: Si los archivos no se trituran, asegúrese de volver a cargar la carpeta en la que estaba el archivo antes de la trituración. Asegúrese también de que el archivo no es un acceso directo al archivo que desee triturar.
it: Se i file non vengono distrutti, assicurati di ricaricare la cartella in quella in cui si trovava il file prima della distruzione. Assicurati anche che il file non sia un collegamento al file che vuoi distruggere.

source: If the problem still persists, please go to the <link href="https://github.com/ADBeveridge/raider/issues">issues page</link> and enter your specific problem.
es: Si el problema persiste, diríjase a la página de <link href="https://github.com/ADBeveridge/raider/issues">incidencias</link> e introduzca su problema específico.
it: Se il problema persiste, vai alla pagina <link href="https://github.com/ADBeveridge/raider/issues">pagina dei problemi</link> e inserisci il tuo problema specifico.

source: Fine-tune the basic options.
es: Ajustar las opciones básicas.
it: Regolare le opzioni di base.

source: Basic Options
es: Opciones básicas
it: Opzioni di Base

source: To configure the shredding options, click on <gui>Preferences</gui> in the upper right corner of the window, next to the three stacked bars. Or click on the three stacked bars and select <gui>Preferences</gui>.
es: Para configurar las opciones de trituración, haga clic en <gui>Preferencias</gui> en la esquina superior derecha de la ventana, junto a las tres barrasapiladas. O haga clic en las tres barras apiladas y seleccione<gui>Preferencias</gui>.

source: There are three options presented:
es: Hay tres opciones presentadas:
it: Sono presentate tre opzioni:

source: The <cmd>Number of passes</cmd> option allows you to shred a file so many times. The maximum is 25, because that is when all internal shredding patterns have been used, and more shredding would not be useful.
es: La opción <cmd>Número de pasadas</cmd> permite triturar un archivo tantas veces. El máximo es 25, porque es cuando se han usado todos los patrones de trituración internos, y más trituración no sería útil.
it: L'opzione <cmd>Numero di passaggi</cmd> ti permette di distruggere un file tante volte. Il massimo è 25, perché è quando tutti i modelli di.

source: If you want to keep the file on your system, uncheck the <cmd>Remove after shredding</cmd> option; it is enabled by default. The file will contain garbage, and will not be able to be opened by a regular text editor. It will not have its previous contents.
es: Si quiere mantener el archivo en su sistema, desmarque la opción <cmd>Eliminar después de triturar</cmd>; está activada por defecto. El archivo contendrá basura, y no podrá ser abierto por un editor de texto normal. No tendrá su contenido anterior.
it: Se vuoi mantenere il file sul tuo sistema, deseleziona l'opzione <cmd>Elimina dopo la distruzione</cmd>;questo è abilitato per impostazione predefinita. Il file conterrà spazzatura e non potà essere aperto da un editor di testo normale. Non avrà il suo contenuto precedente.

source: The <cmd>Hide shredding</cmd> option does one more pass when it has finished shredding the file as many times as requested in the <cmd> Number of passes</cmd> to conceal the fact that shredding has been done on it. One of the hallmarks of a shredded file is that it contains random data, but the <cmd>Hide shredding</cmd> option overwrites it with zeros, making it look like an empty part of the file system.
es: La opción <cmd>Ocultar trituración</cmd> realiza una pasada más cuando ha terminado de triturar el archivo tantas veces como se solicite en el <cmd>Número de pasadas</cmd> para ocultar que se ha hecho una trituración en él. Una de las características de un archivo triturado es que contiene datos aleatorios, pero la opción <cmd>Ocultar trituración</cmd> los sobrescribe con ceros, haciendo que parezca una parte vacía del sistema de archivos.
it: L'opzione <cmd>Nascondi distruzione</cmd> esegue un altro passaggio quando ha finito di distruggere il file tutte le volte che è stato richiesto in <cmd>Numero di passaggi</cmd> per nascondere che è stata fatta una distruzione su questo. Una delle caratteristiche di un file distrutto è che contiene dati casuale, ma l'opzione <cmd>Nascondi distruzione</cmd> li sovrascrive con zeri, facendola sembrare una parte vuota del file system.

source: Fine-tune the advanced options.
es: Ajustar las opciones avanzadas.
it: Regolare le opzioni avanzate.

source: Advanced Options
es: Opciones avanzadas
it: Opzioni avanzate

source: To configure the shredding options, click on <gui>Preferences</gui> in the upper right corner of the window, next to the three stacked bars. Or click on the three stacked bars and select <gui>Preferences</gui>. Then click on the <gui>Advanced</gui> tab in the top of the window.
es: Para configurar las opciones de trituración, haga clic en <gui>Preferencias</gui> en la esquina superior derecha de la ventana, junto a las tres barras apiladas. O haga clic en las tres barras apiladas y seleccione <gui>Preferencias</gui>. A continuación, haga clic en la pestaña de <gui>Avanzadas</gui> en la parte superior de la ventana.
it: Para configurar las opciones de trituración, haga clic en <gui>Preferencias</gui>nell'angolo in alto a destra della finestra, accanto alle tre barre impilate. Oppure fai clic sulle tre barre impilate e seleziona <gui>Preferenze</gui>. Quindi fare clic sulla scheda <gui>Avanzate</gui> nella parte superiore della finestra.

source: There are five options presented:
es: Hay cinco opciones presentadas:
it: Sono presentate cinque opzioni:

source: The <cmd>Remove method</cmd> option controls how the file is removed from the file system. File Shredder can rename the file in such a way that it is very hard to detect that it existed. <cmd>Wipesync</cmd> and <cmd>Wipe</cmd> both do this, but <cmd>Wipesync</cmd> makes sure that each file change is synced to disk. File Shredder renames the file to eight zeros, then seven, and so on. <cmd>Wipe</cmd> does not make sure that the renaming is synced to disk.
es: La opción <cmd>Método de eliminación</cmd> controla cómo se elimina el archivo del sistema de archivos. Trituradora de archivos puede cambiar el nombre del archivo de tal manera que sea muy difícil detectar que existía. <cmd>Limpiar y sincronizar</cmd> y <cmd>Limpiar</cmd> hacen esto, pero <cmd>Limpiar y sincronizar</cmd> se asegura de que cada cambio de archivo se sincronice con el disco. Trituradora de archivos cambia el nombre del archivo a ocho ceros, luego a siete, y así sucesivamente. <cmd>Limpiar</cmd> no se asegura de que el cambio de nombre se sincronice con el disco.
it: L'opzione <cmd>Metodo di rimozione</cmd> controlla come il file viene rimosso da il file system. File Shredder può rinominare il file in modo che sia molto difficile da rilevare che esistesse. <cmd>Wipesync</cmd> e <cmd>Wipe</cmd> entrambi lo fanno, ma <cmd>Wipesync</cmd> si assicura che ogni modifica al file sia sincronizzato su disco. File Shredder rinomina il file in otto zeri, poi sette, e così via. <cmd>Wipe</cmd> non assicura che la ridenominazione sia sincronizzata con il disco.

source: Some file systems automatically sync the renames, which makes <cmd>Wipesync</cmd> useless, but some do not do this automatically, so File Shredder can force it to do so with <cmd>Wipesync</cmd>.
es: Algunos sistemas de archivos sincronizan automáticamente los nombres, lo que hace que <cmd>Limpiar y sincronizar</cmd> sea inútil, pero otros no lo hacen automáticamente, por lo que Trituradora de archivos puede forzarlo a hacerlo con <cmd>Limpiar y sincronizar</cmd>.
it: Alcuni file system sincronizzano automaticamente le rinominazioni, il che rende <cmd>Wipesync</cmd> inutile, ma alcuni non lo fanno automaticamente, quindi File Shredder può forzalo a farlo con <cmd>Wipesync</cmd>.

source: If you want to overwrite a file with a specific pattern, place it in a file and on the <cmd>Get overwrite data from</cmd> option, select the file which you created.
es: Si desea sobrescribir un archivo con un patrón específico, colóquelo en un archivo y en la opción <cmd>Obtener datos de sobrescritura de</cmd>, seleccione el archivo que creó.
it: Se vuoi sovrascrivere un file con uno schema specifico, mettilo in un file e sull'opzione <cmd>Sovrascrivi dati da</cmd>, seleziona il file che tu hai creato.

source: To partially shred a file, enter the number of bytes that you want to shred. It will treat the number as an delimiter, shredding only that part of the file. You also can enter the number of bytes in kilobytes, megabytes, and gigabytes. Here are examples: <cmd>8 </cmd> for 8 bytes; <cmd>4K</cmd> for 4 kilobytes; <cmd>9M</cmd> for 9 megabytes; <cmd>5G</cmd> for 5 gigabytes.
es: Para triturar parcialmente un archivo, introduzca el número de bytes que desee triturar. Tratará el número como un delimitador, triturando sólo esa parte del archivo. También puede introducir el número de bytes en kilobytes, megabytes y gigabytes. Aquí hay ejemplos: <cmd>8 </cmd> para 8 bytes; <cmd>4K</cmd> para 4 kilobytes; <cmd>9M</cmd> para 9 megabytes; <cmd>5G</cmd> para 5 gigabytes.
it: Per distruggere parzialmente un file, inserisci il numero di byte che vuoi distruggere. Tratterà il numero come un delimitatore, distruggendo solo quella parte del file. Puoi anche inserire il numero di byte in kilobyte, megabyte e gigabyte. Ecco alcuni esempi: <cmd>8</cmd> per 8 byte; <cmd>4K</cmd> per 4 kilobyte; <cmd>9M</cmd> per 9 megabyte; <cmd>5G</cmd> per 5 gigabyte.

source: If you do not want the file size to be rounded up to the next full block, check <cmd>Do not round file sizes to the next block</cmd>. It usually is not needed except in borderline cases because <app>File Shredder</app> automatically does this in the case of non-regular files.
es: Si no quiere que el tamaño del archivo se redondee al siguiente bloque completo, marque <cmd>No redondear el tamaño de los archivos al siguiente bloque</cmd>. Normalmente no es necesario, salvo en casos límite, porque <app>Trituradora de archivos</app> lo hace automáticamente en el caso de archivos no regulares.
it: Se non si desidera che la dimensione del file venga arrotondata al blocco intero successivo,check <cmd>Non arrotondare le dimensioni dei file al blocco successivo</cmd>. Di solito non necessario se non in casi limite perché <app>File Shredder</app>lo fa automaticamente nel caso di file non regolari.

source: <cmd>Override file permissions when shredding</cmd> is used to change permissions to allow writing if necessary.
es: <cmd>Sobrescribir los permisos de los archivos al triturarlos</cmd> se usa para cambiar los permisos y permitir la escritura si es necesario.
it: <cmd>Sostituisci i permessi dei file quando viene utilizzata la distruzione</cmd> per modificare autorizzazioni per consentire la scrittura, se necessario.

source: This option will not work on files that belong to the root user only, as a regular user cannot change a root user's file without their permission via password. If you want to shred a root file, log in as root.
es: Esta opción no funcionará en los archivos que pertenezcan únicamente al usuario root, ya que un usuario normal no puede modificar un archivo del usuario root sin su permiso mediante contraseña. Si quiere triturar un archivo de root, inicie sesión como root.
it: Questa opzione non funziona su file che appartengono solo a utente root, poiché un utente normale non può modificare un file di utente root senza il tuo permesso tramite password. Se vuoi distruggere un file root, accedi come root.
