Repository: 0xMRTT/raider
Catalog: po/*.po
Languages: es, pt, pt_br, sv

source: File Shredder
es: Trituradora de archivos
pt_br: Fragmentadora de Arquivos
sv: Filförstörare

source: Securely delete your files
es: Eliminar sus archivos de forma segura
pt: Apague seus archivos de forma segura
pt_br: Delete seus arquivos com segurança
sv: Ta bort dina filer säkert

source: File Shredder is a simple application used for securely deleting your files that you do not want to be recovered. File Shredder has a comprehensive set of preferences and progress tracking for each file.
es: Trituradora de archivos es una sencilla aplicación que sirve para eliminar de forma segura los archivos que no desea recuperar. Trituradora de archivos cuenta con un amplio conjunto de preferencias y seguimiento del progreso de cada archivo.
pt: File Shredder é um programa utilizado para apagar seus arquivos de forma segura, que impossibilita a recuperação deles. File Shredder tem um amplo conjunto de preferências com acompanhamento do progresso para cada arquivo.
pt_br: A Fragmentadora de Arquivos é uma aplicação simples usada para deletar com segurança os arquivos que você não deseja que sejam recuperados. A Fragmentadora de Arquivos possui um conjunto claro de preferências e acompanhamento de progresso para cada arquivo.

source: User interface fixes
es: Correcciones en la interfaz de usuario
pt_br: Correções da interface de usuário

source: Added explantory message and changed initial view's icon
pt_br: Mensagem explicatória adicionada e ícone de visão inicial alterado

source: Added icon to add button in headerbar
es: Se ha añadido un icono para añadir un botón en la barra de encabezamiento
pt_br: Ícone para adicionar um botão à barra de cabeçalho adicionado

source: Fixed cropping of keyboard focus ring on shred button
es: Corregido el recorte del anillo de enfoque del teclado en el botón de trituración
pt_br: Consertado o corte do anel de foco do teclado no botão fragmentar

source: Updated preferences to be more concise and explanatory
es: Actualización de las preferencias para que sean más concisas y explicativas
pt_br: Preferências atualizadas para ser mais concisas e explicativas

source: Add icon to open button in headerbar
es: Añadir un icono para abrir el botón en la barra de cabecera
pt_br: Adicionado um ícone para o botão abrir na barra de cabeçalho

source: Bug fixes and translation updates
es: Corrección de errores y actualización de las traducciones
pt_br: Correções de bugs e atualizações de traduções

source: Added the French translation
es: Añadida la traducción al francés
pt_br: Tradução para o Francês adicionada

source: Added the Portuguese translation
es: Añadida la traducción al portugués
pt_br: Tradução para o Português adicionada

source: Updated the Russian translation
es: Actualizada la traducción al ruso
pt_br: Tradução para o Russo atualizada

source: Fixed progress retrieval bug
es: Se ha corregido un error en la recuperación del progreso
pt_br: Bug de resgate de andamento corrigido

source: Fixed display problems
es: Se han solucionado los problemas de visualización
pt_br: Problemas de exibição corrigidos

source: Minor fixes, including:
es: Correcciones menores, incluyendo:
pt: Pequenos consertos, alguns deles:
pt_br: Correções menores, incluindo:

source: Moved the Shred button to the bottom of the window
es: Se ha movido el botón de trituración a la parte inferior de la ventana
pt: Movido o botão Triturar à parte inferior da janela
pt_br: Botão Fragmentar movido para o fundo da janela

source: Support for mobile devices added
es: Se ha añadido soporte para dispositivos móviles
pt: Adicionado suporte para dispositivos móveis
pt_br: Adicionado o suporte a dispositivos móveis

source: Rethemed the file rows to standard look
es: Reajuste de las filas de archivos a la apariencia estándar
pt: Reintegração das linhas de arquivo ao estilo padrão
pt_br: Reestilização das linhas de arquivo para um visual padrão

source: A significant rewite of File Shredder, with a few UI changes changes:
es: Una reescritura significativa de Trituradora de archivos, con algunos cambios en la interfaz de usuario:
pt: Modificação significativa de código do File Shredder, com algumas alterações da IU:
pt_br: Uma reescrita significativa da Fragmentadora de Arquivos, com algumas mudanças na interface de usuário:

source: Added checking so a file cannot be loaded twice
es: Se ha añadido una comprobación para que un archivo no se cargue dos veces
pt: Adicionada a verificação para que nenhum arquivo possa ser carregado duas vezes
pt_br: Checagem para que um arquivo não seja adicionado duas vezes adicionada
sv: Lade till kontroll så att en fil inte kan läsas in två gånger

source: Smooth progress tracking
es: Seguimiento fluido del progreso
pt: Acompanhamento do progresso consistente
pt_br: Acompanhamento de andamento suave
sv: Smidig förloppsspårning

source: Written using GTK4 and Adwaita
es: Escrito con GTK4 y Adwaita
pt: Feito usando GTK4 e Adwaita
pt_br: Escrito utilizando GTK4 e Adwaita
sv: Skriven med GTK4 och Adwaita

source: Desktop notifications are shown if the window is not focused
es: Las notificaciones del escritorio se muestran si la ventana no está enfocada
pt: As notificações na área de trabalho são mostradas quando a janela não estiver focada
pt_br: Notificações de área de trabalho são mostradas se a janela não estiver em foco
sv: Skrivbordsaviseringar visas om programfönstret inte är fokuserat

source: The very first release of File Shredder. It supports progress tracking, and boasts a GNOME compliant interface.
es: La primera versión de Trituradora de archivos. Soporta el seguimiento del progreso, y cuenta con una interfaz compatible con GNOME.
pt: O primeiro lançamento do File Shredder. Com suporte ao acompanhamento do progresso e uma interface compatível com o GNOME.
pt_br: O primeiro lançamento da Fragmentadora de Arquivos. Ela suporta acompanhamento do andamento e ostenta uma interface que compactua com o GNOME.
sv: Den allra första utgåvan av File Shredder. Den stöder förloppsspårning och har ett GNOME-kompatibelt gränssnitt.

source: Hide shredding
es: Ocultar trituración
pt: Mascarar trituração
pt_br: Ocultar fragmentação

source: Whether to hide shredding. This is done by overwriting the file(s) with zeros.
es: Si se quiere ocultar la trituración. Esto se hace sobrescribiendo los archivos con ceros.
pt: Se mascarar a trituração. Isto é feito substituindo o(s) arquivo(s) com zeros.
pt_br: Se deve ocultar a fragmentação. Isto é feito sobrescrevendo o(s) arquivo(s) com zeros.

source: Remove file
es: Eliminar archivo
pt: Remover arquivo
pt_br: Remover arquivo

source: Whether to remove the file after shredding it.
es: Si se elimina el archivo después de triturarlo.
pt: Se o arquivo deve ser removido após a trituração.
pt_br: Se deve remover o arquivo após fragmentá-lo.

source: Number of passes
es: Número de pasadas
pt: Quantas vezes
pt_br: Número de passagens
sv: Antal pass

source: How many times the file will be overwritten with random data.
es: Cuántas veces se sobrescribirá el archivo con datos aleatorios.
pt: Quantas vezes o arquivo será substituído com dados aleatórios.
pt_br: Quantas vezes o arquivo será sobrescrito com dados aleatórios.

source: Remove method
es: Método de eliminación
pt: Método de remoção
pt_br: Método de remoção

source: How the obfucticated file will be removed from the filesystem.
es: Cómo se eliminará el archivo ofuscado del sistema de archivos.
pt: Como o arquivo ofuscado será removido do sistema de arquivos.
pt_br: Como o arquivo obfuscado será removido do sistema de arquivos.

source: Override Permisions
es: Anular permisos
pt: Ignorar permissões
pt_br: Sobrepor Permissões

source: If you do not have the neccessary permissions, override them.
es: Si no tiene los permisos necesarios, anúlelos.
pt: Se você não tiver permissões suficientes, invalide-as.
pt_br: Se você não possuir as permissões necessárias, sobrepô-las.

source: Do not round to next block
es: No redondear al siguiente bloque
pt: Não passar para o próximo bloco
pt_br: Não arredondar ao próximo bloco

source: Do not round the file to the next block. This is the default for non-regular files.
es: No redondear el archivo al siguiente bloque. Este es el valor predeterminado para los archivos no regulares.
pt: Não arredondar o arquivo ao próximo bloco. Este é o padrão para os arquivos não-regulares.
pt_br: Não arredondar o arquivo ao próximo bloco. Este é o padrão para arquivos irregulares.

source: Number of bytes to shred entry
es: Número de bytes para triturar la entrada
pt: Número de bytes para trituração
pt_br: Entrada do número de bytes a fragmentar

source: Shred the number of bytes you want, and leave the rest of the file untouched.
es: Tritura el número de bytes que desee, y deja el resto del archivo intacto.
pt: Triturar o número de bytes que você quiser e deixar o resto do arquivo inalterado.
pt_br: Fragmentar o número de bytes que você desejar e deixar o restante do arquivo como está.

source: Shred executable
es: Triturar ejecutable
pt: Triturar executável
pt_br: Executável shred

source: The path to the shred executable.
es: La ruta al ejecutable triturado.
pt: O caminho para o executável triturado.
pt_br: O caminho para o executável shred.

source: Whether to allow the source data file to be enabled
es: Si se permite activar el archivo de datos de origen
pt: Se permitir que o arquivo de dados de origem seja ativado
pt_br: Se deve permitir que o arquivo de fonte de dados seja habilitado

source: If unchecked, the source data file will not be loaded.
es: Si no está marcada, no se cargará el archivo de datos de origen.
pt: Se não for selecionado, o arquivo de dados de origem não será carregado.
pt_br: Se desmarcado, o arquivo de fonte de dados não será carregado.

source: Overwrite data file
es: Sobrescribir el archivo de datos
pt: Substituir arquivo de dados
pt_br: Arquivo de dados para sobrescrita

source: Where to get data to overwrite the to-be-shredded files.
es: Dónde obtener los datos para sobrescribir los archivos a destruir.
pt: De onde obter dados para substituir os arquivos que sejam triturados.
pt_br: De onde obter os dados para sobrescrever os arquivos a ser fragmentados.

source: Add Files
es: Añadir archivos
pt: Adicionar arquivos
pt_br: Adicionar Arquivos

source: Cancel
es: Cancelar
pt: Cancelar
pt_br: Cancelar
sv: Avbryt

source: Add
es: Añadir
pt: Adicionar
pt_br: Adicionar

source: Shredded
es: Triturado
pt: Triturado
pt_br: Fragmentado
sv: Makulerad

source: _Basic
pt: _Básico
pt_br: _Básico
sv: _Enkel

source: Basic
es: Básicas
pt: Básico
pt_br: Básico
sv: Grundläggande

source: Remove File
es: Eliminar archivo
pt: Remover arquivo
pt_br: Remover Arquivo
sv: Ta bort fil

source: Whether to remove the file after obfuscating its contents
es: Si se elimina el archivo después de ofuscar su contenido
pt_br: Se deve remover o arquivo após ofuscar seus conteúdos

source: Hide Shredding
es: Ocultar trituración
pt: Mascarar trituração
pt_br: Esconder Fragmentação
sv: Dölj makulering

source: Do a final overwrite with zeros instead of random data. Random data is a clue that the file has been shredded
es: Realiza una sobreescritura final con ceros en lugar de datos aleatorios. Los datos aleatorios son una pista de que el archivo ha sido destruido
pt_br: Fazer uma sobrescrita final com zeros ao invés de dados aleatórios. Dados aleatórios sugerem que um arquivo foi fragmentado

source: How many times to shred file over
es: Cuántas veces hay que triturar el archivo
pt: Quantas vezes triturar o arquivo
pt_br: Quantas vezes fragmentar o arquivo
sv: Hur många gånger filen skall skrivas över

source: Advanced
es: Avanzadas
pt: Avançado
pt_br: Avançado
sv: Avancerat

source: Remove Method
es: Método de eliminación
pt: Método de remoção
pt_br: Método de Remoção

source: How to remove the files from the fileystem
pt: Como remover arquivos do sistema de arquivos
pt_br: Como remover arquivos do sistema de arquivos
sv: Hur filer tas bort från filsystemet

source: Wipe
es: Limpiar
pt: Limpar
pt_br: Limpar

source: Unlink
es: Desvincular
pt: Desvincular
pt_br: Desconectar
sv: Avlänka

source: Overwrite data source
es: Sobrescribir fuente de datos
pt: Substituir a origem de dados
pt_br: Fonte de dados para sobrescrita
sv: Skriv över datakällan

source: Where to get the data to overwrite the files with. Disabled at every startup
es: De dónde sacar los datos para sobrescribir los archivos. Desactivado en cada inicio
pt: De onde obter dados para substituição de arquivos. Desativado em cada inicialização
pt_br: Onde obter os dados usados para sobrescrever os arquivos. Desabilitado a cada inicialização
sv: Var data hämtas för att skriva över filerna med. Inaktiverad vid varje start

source: None Selected
es: Ninguno seleccionada
pt: Nenhum selecionado
pt_br: Nenhum Selecionado
sv: Inget valt

source: Select File
es: Seleccionar archivo
pt: Selecione arquivo
pt_br: Selecionar Arquivo
sv: Välj fil

source: Number of bytes to shred
es: Número de bytes a triturar
pt: Número de bytes para trituração
pt_br: Número de bytes a fragmentar
sv: Antal byte att förstöra

source: How much of the file to shred. 0 to shred the whole file
es: Qué parte del archivo se va a destruir. 0 para destruir todo el archivo
pt: Até que ponto o arquivo deve ser triturado. 0 para triturar o arquivo inteiro
pt_br: Quanto fragmentar do tamanho do arquivo. 0 fragmenta todo o arquivo
sv: Hur mycket av filen som skall förstöras. 0 för att förstöra hela filen

source: Do not round file sizes
es: No redondear el tamaño de los archivos
pt: Não arredondar tamanhos de arquivos
pt_br: Não arredondar tamanhos de arquivos
sv: Avrunda inte filstorlekar

source: Do not round file sizes to the next block. Default for irregular files
es: No redondear el tamaño de los archivos al siguiente bloque. Predeterminado para archivos irregulares
pt: Não arredondar os tamanhos dos arquivos para o próximo bloco. Padrão para arquivos irregulares
pt_br: Não arredondar tamanhos de arquivos para o próximo bloco. Padrão para arquivos irregulares
sv: Avrunda inte filstorlekar till nästa block. Standard för irreguljära filer

source: Override file permissions
es: Anular los permisos de los archivos
pt: Invalidar as permissões de arquivos
pt_br: Sobrepor permissões de arquivos
sv: Åsidosätt filrättigheter

source: Whether to override the file permissions in case of insufficient permissions
es: Si se anulan los permisos de los archivos en caso de que los permisos sean insuficientes
pt: Se deveria substituir as permissões dos arquivos quando não tiver permissões suficientes
pt_br: Se as permissões de arquivos devem ser sobrepostas em caso de permissões insuficientes
sv: Om filrättigheterna skall åsidosättas i händelse av otillräckliga behörigheter

source: Estimating...
es: Estimando...
pt: Calculando...
pt_br: Calculando...
sv: Beräknar...

source: failed
es: falló
pt: falhou
pt_br: falhou
sv: misslyckades

source: removing
es: eliminando
pt_br: removendo

source: removed
es: eliminado
pt: removido
pt_br: removido
sv: borttaget

source: pass
es: paso
pt: passe
pt_br: passagem

source: Add files or drop here
es: Añadir archivos o soltar aquí
pt: Adicione arquivos ou solte aqui
pt_br: Adicione arquivos ou solte-os aqui
sv: Lägg till filer eller släpp här

source: Shredding is the obfuscation of a file with random data so the previous contents cannot be recovered. Learn more about <a href="https://en.wikipedia.org/wiki/Shred_(Unix)">File Shredder's backend</a>.
pt_br: A fragmentação é o obfuscamento de um arquivo com dados aleatórios para que os conteúdos anteriores não possam ser recuperados. Saiba mais sobre o <a href="https://en.wikipedia.org/wiki/Shred_(Unix)">backend da Fragmentadora de Arquivos</a>.

source: Shred All
es: Triturar todo
pt: Triturar tudo
pt_br: Fragmentar Tudo

source: Abort All
es: Abortar todo
pt: Abortar tudo
pt_br: Abortar Tudo

source: New Window
es: Ventana nueva
pt: Nova janela
pt_br: Nova Janela
sv: Nytt fönster

source: Preferences
es: Preferencias
pt: Preferências
pt_br: Preferências
sv: Inställningar

source: Help
es: Ayuda
pt: Ajuda
pt_br: Ajuda
sv: Hjälp

source: About File Shredder
es: Acerca de Trituradora de archivos
pt: Sobre o File Shredder
pt_br: Sobre a Fragmentadora de Arquivos
sv: Om File Shredder

source: Could not remove file from quick list.
pt: Não foi possível remover o arquivo da lista rápida.
pt_br: O arquivo não pôde ser removido da lista rápida.
sv: Kunde inte ta bort fil från snabblistan.

source: Directories are not supported
es: No se admiten directorios
pt: Pastas não são suportadas
pt_br: Diretórios não são suportados

source: “%s” is already loaded
es: "%s" ya está cargado
pt: “%s” já está carregado
pt_br: "%s" já está carregado

source: Cannot write to “%s”
es: No se puede escribir en “%s”
pt: Não foi possível escrever em “%s”
pt_br: Não foi possível escrever em "%s"

source: translator-credits
es: Óscar Fernández Díaz <oscfdezdz@tuta.io>
pt: inkhorn
sv: Åke Engelbrektson <eson@svenskasprakfiler.se>

source: Whether to remove the file after shredding
pt: Se o arquivo deve ser removido após a trituração
sv: Om filen skall tas bort efter makulering

source: Whether to hide the fact the the files have been shredded
pt: Se mascarar o fato de que os arquivos foram triturados
sv: Om det faktum att filerna har förstörts skall döljas

source: File Shredder, also named Raider, is a simple application that enables you to securely delete files that was built with GNOME in mind. It supports all the options that its backend has, plus a realtime progress tracking.
sv: File Shredder, även kallad Raider, är ett enkelt program som gör att du säkert kan ta bort filer som skapades med GNOME i åtanke. Den stöder alla alternativ som dess backend har, plus förloppsspårning i realtid.

source: Handy list for thumb drives on open button
sv: Praktisk lista för externa diskar på öppnaknappen

source: Open File
sv: Öppna fil

source: Open
sv: Öppna

source: Shred
sv: Förstör

source: Abort
sv: Avbryt

source: Devices
sv: Enheter

source: Directories are not supported!
sv: Mappar stöds inte!

source: “%s” is already loaded!
sv: “%s” är redan inläst!
